БПКР/src/Documents/ОтчетПоЕдиномуНалогу/ОтчетПоЕдиномуНалогу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоЕдиномуНалогу</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КварталВыбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЕдиныйНалог</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>EnumRef.ВидыДеятельностиЕН</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНаличная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезналичная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНаличнаяЕдиныйНалог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезналичнаяЕдиныйНалог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/InformationRegisters/СтавкиЕН/СтавкиЕН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиЕН</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СтавкаНаличная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаБезналичная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>EnumRef.ВидыДеятельностиЕН</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Enums/ВидыДеятельностиЕН/ВидыДеятельностиЕН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДеятельностиЕН</name>
  <enumValues>
    <name>ПереработкаПроизводствоТорговля</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>РежимУсловногоНачисленияНДС</name>
  </enumValues>
  <enumValues>
    <name>ШвейноеТекстильноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>Услуги</name>
  </enumValues>
  <enumValues>
    <name>УслугиСаун</name>
  </enumValues>
  <enumValues>
    <name>УслугиБильярда</name>
  </enumValues>
  <enumValues>
    <name>УслугиБань</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Documents/ОтчетПоЕдиномуНалогу/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//@skip-warning
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой НДС
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция устарела_ПечатьЕдиногоНалога(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтчетПоЕдиномуНалогу.Ссылка КАК Ссылка,
		|	ОтчетПоЕдиномуНалогу.Дата КАК Дата,
		|	ОтчетПоЕдиномуНалогу.Организация КАК Организация,
		|	ОтчетПоЕдиномуНалогу.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ОтчетПоЕдиномуНалогу.Организация.ИНН КАК ИНН,
		|	ОтчетПоЕдиномуНалогу.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ОтчетПоЕдиномуНалогу.Организация.ГНС КАК ГНС,
		|	ОтчетПоЕдиномуНалогу.Организация.ГНС.Код КАК КодГНС,
		|	ОтчетПоЕдиномуНалогу.ЕдиныйНалог.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ВидДеятельности КАК ВидДеятельности,
		|		СуммаНаличная КАК СуммаНаличная,
		|		СуммаБезналичная КАК СуммаБезналичная,
		|		СуммаНаличнаяЕдиныйНалог КАК СуммаНаличнаяЕдиныйНалог,
		|		СуммаБезналичнаяЕдиныйНалог КАК СуммаБезналичнаяЕдиныйНалог
		|	) КАК ЕдиныйНалог
		|ИЗ
		|	Документ.ОтчетПоЕдиномуНалогу КАК ОтчетПоЕдиномуНалогу
		|ГДЕ
		|	ОтчетПоЕдиномуНалогу.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоЕдиномуНалогу_устарела_ОтчетПоЕдиномуНалогу";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоЕдиномуНалогу.устарела_ПФ_MXL_ОтчетПоЕдиномуНалогу");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеУчетнойПолитики = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(Шапка.Дата, Шапка.Организация);
		
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("Организация", 	?(Шапка.ОрганизацияНаименованиеПолное = "", Шапка.Организация, Шапка.ОрганизацияНаименованиеПолное));
		
		КонтактныеДанные = ПолучитьКонтактнуюИнформацию(Шапка.Организация);

		ДанныеПечати.Вставить("Адрес", КонтактныеДанные.АдрОбластьГород);
		ДанныеПечати.Вставить("Улица", КонтактныеДанные.АдресОрганизации);
		ДанныеПечати.Вставить("Телефон", КонтактныеДанные.Телефон);
		ДанныеПечати.Вставить("ЭлПочта", КонтактныеДанные.Email);
		
		Если ЗначениеЗаполнено(Шапка.ИНН) Тогда
			ИНН = Шапка.ИНН;
			ДанныеПечати.Вставить("ИНН1", Сред(ИНН, 1, 1));
			ДанныеПечати.Вставить("ИНН2", Сред(ИНН, 2, 1));
			ДанныеПечати.Вставить("ИНН3", Сред(ИНН, 3, 1));                           
			ДанныеПечати.Вставить("ИНН4", Сред(ИНН, 4, 1));
			ДанныеПечати.Вставить("ИНН5", Сред(ИНН, 5, 1));
			ДанныеПечати.Вставить("ИНН6", Сред(ИНН, 6, 1));
			ДанныеПечати.Вставить("ИНН7", Сред(ИНН, 7, 1));
			ДанныеПечати.Вставить("ИНН8", Сред(ИНН, 8, 1));
			ДанныеПечати.Вставить("ИНН9", Сред(ИНН, 9, 1));
			ДанныеПечати.Вставить("ИНН10", Сред(ИНН, 10, 1));
			ДанныеПечати.Вставить("ИНН11", Сред(ИНН, 11, 1));
			ДанныеПечати.Вставить("ИНН12", Сред(ИНН, 12, 1));
			ДанныеПечати.Вставить("ИНН13", Сред(ИНН, 13, 1));
			ДанныеПечати.Вставить("ИНН14", Сред(ИНН, 14, 1));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.КодПоОКПО) Тогда
			ОКПО = Шапка.КодПоОКПО;
			ДанныеПечати.Вставить("ОКПО1", Сред(ОКПО, 1, 1));
			ДанныеПечати.Вставить("ОКПО2", Сред(ОКПО, 2, 1));
			ДанныеПечати.Вставить("ОКПО3", Сред(ОКПО, 3, 1));                           
			ДанныеПечати.Вставить("ОКПО4", Сред(ОКПО, 4, 1));
			ДанныеПечати.Вставить("ОКПО5", Сред(ОКПО, 5, 1));
			ДанныеПечати.Вставить("ОКПО6", Сред(ОКПО, 6, 1));
			ДанныеПечати.Вставить("ОКПО7", Сред(ОКПО, 7, 1));
			ДанныеПечати.Вставить("ОКПО8", Сред(ОКПО, 8, 1));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.ГНС) Тогда
			ДанныеПечати.Вставить("НаименованиеГНС", Шапка.ГНС);
			КодГНС = Шапка.КодГНС;
			ДанныеПечати.Вставить("ГНС1", Сред(КодГНС, 1, 1));
			ДанныеПечати.Вставить("ГНС2", Сред(КодГНС, 2, 1));
			ДанныеПечати.Вставить("ГНС3", Сред(КодГНС, 3, 1));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтактныеДанные.Индекс) Тогда
			Индекс = КонтактныеДанные.Индекс;
			ДанныеПечати.Вставить("Индекс1", Сред(Индекс, 1, 1));
			ДанныеПечати.Вставить("Индекс2", Сред(Индекс, 2, 1));
			ДанныеПечати.Вставить("Индекс3", Сред(Индекс, 3, 1));
			ДанныеПечати.Вставить("Индекс4", Сред(Индекс, 4, 1));
			ДанныеПечати.Вставить("Индекс5", Сред(Индекс, 5, 1));
			ДанныеПечати.Вставить("Индекс6", Сред(Индекс, 6, 1));
		КонецЕсли;
		
		Если Месяц(Шапка.Дата) = 1 ИЛИ Месяц(Шапка.Дата) = 2 ИЛИ Месяц(Шапка.Дата) = 3 Тогда
			Квартал = 1;
			
		ИначеЕсли Месяц(Шапка.Дата) = 4 ИЛИ Месяц(Шапка.Дата) = 5 ИЛИ Месяц(Шапка.Дата) = 6 Тогда
			Квартал = 2;
			
		ИначеЕсли Месяц(Шапка.Дата) = 7 ИЛИ Месяц(Шапка.Дата) = 8 ИЛИ Месяц(Шапка.Дата) = 9 Тогда
			Квартал = 3;
			
		ИначеЕсли Месяц(Шапка.Дата) = 10 ИЛИ Месяц(Шапка.Дата) = 11 ИЛИ Месяц(Шапка.Дата) = 12 Тогда
			Квартал = 4;
		КонецЕсли;
		
		ДанныеПечати.Вставить("Квартал", Квартал);
		ДанныеПечати.Вставить("Год1", Сред(Шапка.Дата, 7, 1));	
		ДанныеПечати.Вставить("Год2", Сред(Шапка.Дата, 8, 1));	
		ДанныеПечати.Вставить("Год3", Сред(Шапка.Дата, 9, 1));	
		ДанныеПечати.Вставить("Год4", Сред(Шапка.Дата, 10, 1));
		
		ДанныеПечати.Вставить("СуммаТоргНал", 			0);
		ДанныеПечати.Вставить("СтавкаТоргНал", 			0);
		ДанныеПечати.Вставить("СуммаНалогаТоргНал", 	0);
		ДанныеПечати.Вставить("СуммаТоргБезНал", 		0);
		ДанныеПечати.Вставить("СтавкаТоргБезНал", 		0);
		ДанныеПечати.Вставить("СуммаНалогаТоргБезНал", 	0);
		ДанныеПечати.Вставить("СуммаНалогаИтогТорг", 	0);
		
		ДанныеПечати.Вставить("СуммаПрочееНал", 		0);
		ДанныеПечати.Вставить("СтавкаПрочееНал", 		0);
		ДанныеПечати.Вставить("СуммаНалогаПрочееНал", 	0);
		ДанныеПечати.Вставить("СуммаПрочееБезНал", 		0);
		ДанныеПечати.Вставить("СтавкаПрочееБезНал", 	0);
		ДанныеПечати.Вставить("СуммаНалогаПрочееБезНал",0);
		ДанныеПечати.Вставить("СуммаНалогаИтогПрочее", 	0);
		
		Выборка = Шапка.ЕдиныйНалог.Выбрать();
		Пока Выборка.Следующий() Цикл
					
			Если Выборка.ВидДеятельности = Перечисления.ВидыДеятельностиЕН.ПереработкаПроизводствоТорговля Тогда
				
				ДанныеПечати.СуммаТоргНал 				= Выборка.СуммаНаличная;
				ДанныеПечати.СтавкаТоргНал 				= ДанныеУчетнойПолитики.СтавкаЕННаличнаяФорма1;
				ДанныеПечати.СуммаНалогаТоргНал 		= Выборка.СуммаНаличнаяЕдиныйНалог;
				
				ДанныеПечати.СуммаТоргБезНал 			= Выборка.СуммаБезналичная;
				ДанныеПечати.СтавкаТоргБезНал 			= ДанныеУчетнойПолитики.СтавкаЕНБезНаличнаяФорма1;
				ДанныеПечати.СуммаНалогаТоргБезНал 		= Выборка.СуммаБезналичнаяЕдиныйНалог;
				
				ДанныеПечати.СуммаНалогаИтогТорг 		= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог; 
				
			Иначе
				ДанныеПечати.СуммаПрочееНал 			= Выборка.СуммаНаличная;
				ДанныеПечати.СтавкаПрочееНал 			= ДанныеУчетнойПолитики.СтавкаЕННаличнаяФорма2;
				ДанныеПечати.СуммаНалогаПрочееНал 		= Выборка.СуммаНаличнаяЕдиныйНалог;
				
				ДанныеПечати.СуммаПрочееБезНал 			= Выборка.СуммаБезналичная;
				ДанныеПечати.СтавкаПрочееБезНал 		= ДанныеУчетнойПолитики.СтавкаЕНБезНаличнаяФорма2;
				ДанныеПечати.СуммаНалогаПрочееБезНал 	= Выборка.СуммаБезналичнаяЕдиныйНалог;
				
				ДанныеПечати.СуммаНалогаИтогПрочее 		= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог;
			КонецЕсли;	
		КонецЦикла;	
		
		ДанныеПечати.Вставить("СуммаНалогаИтогОбщий", ДанныеПечати.СуммаНалогаИтогТорг + ДанныеПечати.СуммаНалогаИтогПрочее); 
		
		ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой НДС
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьЕдиногоНалога(МассивОбъектов, ОбъектыПечати)	
	
	Для каждого ДокументСсылка Из МассивОбъектов Цикл
		
		Запрос = Новый Запрос;		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтчетПоЕдиномуНалогу.Ссылка КАК Ссылка,
		|	ОтчетПоЕдиномуНалогу.Дата КАК Дата,
		|	ОтчетПоЕдиномуНалогу.НачалоПериода КАК НачалоПериода,
		|	ОтчетПоЕдиномуНалогу.КонецПериода КАК КонецПериода,
		|	ОтчетПоЕдиномуНалогу.Организация КАК Организация,
		|	ОтчетПоЕдиномуНалогу.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ОтчетПоЕдиномуНалогу.Организация.ИНН КАК ИНН,
		|	ОтчетПоЕдиномуНалогу.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ОтчетПоЕдиномуНалогу.Организация.ГНС КАК ГНС,
		|	ОтчетПоЕдиномуНалогу.Организация.ГНС.Код КАК КодГНС
		|ИЗ
		|	Документ.ОтчетПоЕдиномуНалогу КАК ОтчетПоЕдиномуНалогу
		|ГДЕ
		|	ОтчетПоЕдиномуНалогу.Ссылка В(&ДокументСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтчетПоЕдиномуНалогуЕдиныйНалог.Ссылка КАК Ссылка,
		|	ОтчетПоЕдиномуНалогуЕдиныйНалог.НомерСтроки КАК НомерСтроки,
		|	ОтчетПоЕдиномуНалогуЕдиныйНалог.ВидДеятельности КАК ВидДеятельности,
		|	ОтчетПоЕдиномуНалогуЕдиныйНалог.СуммаНаличная КАК СуммаНаличная,
		|	ОтчетПоЕдиномуНалогуЕдиныйНалог.СуммаБезналичная КАК СуммаБезналичная,
		|	ОтчетПоЕдиномуНалогуЕдиныйНалог.СуммаНаличнаяЕдиныйНалог КАК СуммаНаличнаяЕдиныйНалог,
		|	ОтчетПоЕдиномуНалогуЕдиныйНалог.СуммаБезналичнаяЕдиныйНалог КАК СуммаБезналичнаяЕдиныйНалог,
		|	СтавкиЕНСрезПоследних.СтавкаНаличная КАК СтавкаНаличная,
		|	СтавкиЕНСрезПоследних.СтавкаБезналичная КАК СтавкаБезналичная
		|ИЗ
		|	Документ.ОтчетПоЕдиномуНалогу.ЕдиныйНалог КАК ОтчетПоЕдиномуНалогуЕдиныйНалог
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиЕН.СрезПоследних КАК СтавкиЕНСрезПоследних
		|		ПО ОтчетПоЕдиномуНалогуЕдиныйНалог.ВидДеятельности = СтавкиЕНСрезПоследних.ВидДеятельности
		|ГДЕ
		|	ОтчетПоЕдиномуНалогуЕдиныйНалог.Ссылка В(&ДокументСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";	
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		Шапка = РезультатЗапроса[0].Выбрать();
		ТаблицаЕН = РезультатЗапроса[1];
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоЕдиномуНалогу_ОтчетПоЕдиномуНалогу";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоЕдиномуНалогу.ПФ_MXL_ОтчетПоЕдиномуНалогу");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		Пока Шапка.Следующий() Цикл
			Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;		
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ДанныеУчетнойПолитики = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(Шапка.Дата, Шапка.Организация);
			
			ДанныеПечати = Новый Структура;
			ДанныеПечати.Вставить("Организация", 	?(Шапка.ОрганизацияНаименованиеПолное = "", Шапка.Организация, Шапка.ОрганизацияНаименованиеПолное));
			
			КонтактныеДанные = ПолучитьКонтактнуюИнформацию(Шапка.Организация);
			
			ДанныеПечати.Вставить("Адрес", КонтактныеДанные.АдрОбластьГород);
			ДанныеПечати.Вставить("Улица", КонтактныеДанные.АдресОрганизации);
			ДанныеПечати.Вставить("Телефон", КонтактныеДанные.Телефон);
			ДанныеПечати.Вставить("ЭлПочта", КонтактныеДанные.Email);
			
			Если ЗначениеЗаполнено(Шапка.ИНН) Тогда
				ИНН = Шапка.ИНН;
				ДанныеПечати.Вставить("ИНН1", Сред(ИНН, 1, 1));
				ДанныеПечати.Вставить("ИНН2", Сред(ИНН, 2, 1));
				ДанныеПечати.Вставить("ИНН3", Сред(ИНН, 3, 1));                           
				ДанныеПечати.Вставить("ИНН4", Сред(ИНН, 4, 1));
				ДанныеПечати.Вставить("ИНН5", Сред(ИНН, 5, 1));
				ДанныеПечати.Вставить("ИНН6", Сред(ИНН, 6, 1));
				ДанныеПечати.Вставить("ИНН7", Сред(ИНН, 7, 1));
				ДанныеПечати.Вставить("ИНН8", Сред(ИНН, 8, 1));
				ДанныеПечати.Вставить("ИНН9", Сред(ИНН, 9, 1));
				ДанныеПечати.Вставить("ИНН10", Сред(ИНН, 10, 1));
				ДанныеПечати.Вставить("ИНН11", Сред(ИНН, 11, 1));
				ДанныеПечати.Вставить("ИНН12", Сред(ИНН, 12, 1));
				ДанныеПечати.Вставить("ИНН13", Сред(ИНН, 13, 1));
				ДанныеПечати.Вставить("ИНН14", Сред(ИНН, 14, 1));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Шапка.КодПоОКПО) Тогда
				ОКПО = Шапка.КодПоОКПО;
				ДанныеПечати.Вставить("ОКПО1", Сред(ОКПО, 1, 1));
				ДанныеПечати.Вставить("ОКПО2", Сред(ОКПО, 2, 1));
				ДанныеПечати.Вставить("ОКПО3", Сред(ОКПО, 3, 1));                           
				ДанныеПечати.Вставить("ОКПО4", Сред(ОКПО, 4, 1));
				ДанныеПечати.Вставить("ОКПО5", Сред(ОКПО, 5, 1));
				ДанныеПечати.Вставить("ОКПО6", Сред(ОКПО, 6, 1));
				ДанныеПечати.Вставить("ОКПО7", Сред(ОКПО, 7, 1));
				ДанныеПечати.Вставить("ОКПО8", Сред(ОКПО, 8, 1));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Шапка.ГНС) Тогда
				ДанныеПечати.Вставить("НаименованиеГНС", Шапка.ГНС);
				КодГНС = Шапка.КодГНС;
				ДанныеПечати.Вставить("ГНС1", Сред(КодГНС, 1, 1));
				ДанныеПечати.Вставить("ГНС2", Сред(КодГНС, 2, 1));
				ДанныеПечати.Вставить("ГНС3", Сред(КодГНС, 3, 1));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КонтактныеДанные.Индекс) Тогда
				Индекс = КонтактныеДанные.Индекс;
				ДанныеПечати.Вставить("Индекс1", Сред(Индекс, 1, 1));
				ДанныеПечати.Вставить("Индекс2", Сред(Индекс, 2, 1));
				ДанныеПечати.Вставить("Индекс3", Сред(Индекс, 3, 1));
				ДанныеПечати.Вставить("Индекс4", Сред(Индекс, 4, 1));
				ДанныеПечати.Вставить("Индекс5", Сред(Индекс, 5, 1));
				ДанныеПечати.Вставить("Индекс6", Сред(Индекс, 6, 1));
			КонецЕсли;
			
			ДатаН = Шапка.НачалоПериода;
			ДатаК = Шапка.КонецПериода;
			
			// Налоговый период 	
			ДанныеПечати.Вставить("ДатаН1", Сред(Формат(ДатаН,"dd"),1,1));	
			ДанныеПечати.Вставить("ДатаН2", Сред(Формат(ДатаН,"dd"),2,1));	
			ДанныеПечати.Вставить("ДатаН3", Сред(Формат(ДатаН,"MM"),4,1));
			ДанныеПечати.Вставить("ДатаН4", Сред(Формат(ДатаН,"MM"),5,1));
			ДанныеПечати.Вставить("ДатаН5", Сред(Формат(ДатаН,"yyyy"),7,1));
			ДанныеПечати.Вставить("ДатаН6", Сред(Формат(ДатаН,"yyyy"),8,1));
			ДанныеПечати.Вставить("ДатаН7", Сред(Формат(ДатаН,"yyyy"),9,1));
			ДанныеПечати.Вставить("ДатаН8", Сред(Формат(ДатаН,"yyyy"),10,1));
			
			ДанныеПечати.Вставить("ДатаК1", Сред(Формат(ДатаК,"dd"),1,1));
			ДанныеПечати.Вставить("ДатаК2", Сред(Формат(ДатаК,"dd"),2,1));								
			ДанныеПечати.Вставить("ДатаК3", Сред(Формат(ДатаК,"MM"),4,1));
			ДанныеПечати.Вставить("ДатаК4", Сред(Формат(ДатаК,"MM"),5,1));							
			ДанныеПечати.Вставить("ДатаК5", Сред(Формат(ДатаК,"yyyy"),7,1));
			ДанныеПечати.Вставить("ДатаК6", Сред(Формат(ДатаК,"yyyy"),8,1));
			ДанныеПечати.Вставить("ДатаК7", Сред(Формат(ДатаК,"yyyy"),9,1));
			ДанныеПечати.Вставить("ДатаК8", Сред(Формат(ДатаК,"yyyy"),10,1));	
			
			ДанныеПечати.Вставить("СуммаТоргНал", 			0);
			ДанныеПечати.Вставить("СтавкаТоргНал", 			0);
			ДанныеПечати.Вставить("СуммаНалогаТоргНал", 	0);
			ДанныеПечати.Вставить("СуммаТоргБезНал", 		0);
			ДанныеПечати.Вставить("СтавкаТоргБезНал", 		0);
			ДанныеПечати.Вставить("СуммаНалогаТоргБезНал", 	0);
			ДанныеПечати.Вставить("СуммаНалогаИтогТорг", 	0);
			
			ДанныеПечати.Вставить("СуммаПрочееНал", 		0);
			ДанныеПечати.Вставить("СтавкаПрочееНал", 		0);
			ДанныеПечати.Вставить("СуммаНалогаПрочееНал", 	0);
			ДанныеПечати.Вставить("СуммаПрочееБезНал", 		0);
			ДанныеПечати.Вставить("СтавкаПрочееБезНал", 	0);
			ДанныеПечати.Вставить("СуммаНалогаПрочееБезНал",0);
			ДанныеПечати.Вставить("СуммаНалогаИтогПрочее", 	0);
			
			ДанныеПечати.Вставить("СуммаУслНДС", 		0);
			ДанныеПечати.Вставить("СтавкаУслНДС", 		0);
			ДанныеПечати.Вставить("СуммаНалогаУслНДС", 0);
			
			ДанныеПечати.Вставить("СуммаШвейное", 		0);
			ДанныеПечати.Вставить("СтавкаШвейное", 		0);
			ДанныеПечати.Вставить("СуммаНалогаШвейное", 0);
			
			ДанныеПечати.Вставить("СуммаУслуги", 		0);
			ДанныеПечати.Вставить("СтавкаУслуги", 		0);
			ДанныеПечати.Вставить("СуммаНалогаУслуги",	0);
			
			ДанныеПечати.Вставить("СуммаСауна", 		0);
			ДанныеПечати.Вставить("СтавкаСауна", 		0);
			ДанныеПечати.Вставить("СуммаНалогаСауна",	0);
			
			ДанныеПечати.Вставить("СуммаБильярд", 		0);
			ДанныеПечати.Вставить("СтавкаБильярд", 		0);
			ДанныеПечати.Вставить("СуммаНалогаБильярд",	0);
			
			ДанныеПечати.Вставить("СуммаБаня", 			0);
			ДанныеПечати.Вставить("СтавкаБаня", 		0);
			ДанныеПечати.Вставить("СуммаНалогаБаня",	0);
			
			ДанныеПечати.Вставить("СуммаНалогаРаздел4", 0);
			
			Выборка = ТаблицаЕН.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ВидДеятельности = Перечисления.ВидыДеятельностиЕН.ПереработкаПроизводствоТорговля Тогда
					
					Если Выборка.СуммаНаличная <> 0 Тогда 
						ДанныеПечати.СуммаТоргНал 				= Выборка.СуммаНаличная;
						ДанныеПечати.СтавкаТоргНал 				= Выборка.СтавкаНаличная;
						ДанныеПечати.СуммаНалогаТоргНал 		= Выборка.СуммаНаличнаяЕдиныйНалог;
					КонецЕсли;
					
					Если Выборка.СуммаБезналичная <> 0 Тогда
						ДанныеПечати.СуммаТоргБезНал 			= Выборка.СуммаБезналичная;
						ДанныеПечати.СтавкаТоргБезНал 			= Выборка.СтавкаБезналичная;
						ДанныеПечати.СуммаНалогаТоргБезНал 		= Выборка.СуммаБезналичнаяЕдиныйНалог;
					КонецЕсли;

					ДанныеПечати.СуммаНалогаИтогТорг 		= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог; 
					
				ИначеЕсли Выборка.ВидДеятельности = Перечисления.ВидыДеятельностиЕН.Прочее Тогда
					
					Если Выборка.СуммаНаличная <> 0 Тогда 
						ДанныеПечати.СуммаПрочееНал 			= Выборка.СуммаНаличная;
						ДанныеПечати.СтавкаПрочееНал 			= Выборка.СтавкаНаличная;
						ДанныеПечати.СуммаНалогаПрочееНал 		= Выборка.СуммаНаличнаяЕдиныйНалог;
					КонецЕсли;
					
					Если Выборка.СуммаБезналичная <> 0 Тогда
						ДанныеПечати.СуммаПрочееБезНал 			= Выборка.СуммаБезналичная;
						ДанныеПечати.СтавкаПрочееБезНал 		= Выборка.СтавкаБезналичная;
						ДанныеПечати.СуммаНалогаПрочееБезНал 	= Выборка.СуммаБезналичнаяЕдиныйНалог;
					КонецЕсли;

					ДанныеПечати.СуммаНалогаИтогПрочее 		= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог;
					
				ИначеЕсли Выборка.ВидДеятельности = Перечисления.ВидыДеятельностиЕН.РежимУсловногоНачисленияНДС Тогда
					
					ДанныеПечати.СуммаУслНДС 				= Выборка.СуммаНаличная + Выборка.СуммаБезналичная;
					ДанныеПечати.СтавкаУслНДС 				= Выборка.СтавкаНаличная;
					ДанныеПечати.СуммаНалогаУслНДС	 		= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог;
					
				ИначеЕсли Выборка.ВидДеятельности = Перечисления.ВидыДеятельностиЕН.ШвейноеТекстильноеПроизводство Тогда
					
					ДанныеПечати.СуммаШвейное 				= Выборка.СуммаНаличная + Выборка.СуммаБезналичная;
					ДанныеПечати.СтавкаШвейное 				= Выборка.СтавкаНаличная;
					ДанныеПечати.СуммаНалогаШвейное 		= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог;
					
				ИначеЕсли Выборка.ВидДеятельности = Перечисления.ВидыДеятельностиЕН.Услуги Тогда
					
					ДанныеПечати.СуммаУслуги 				= Выборка.СуммаНаличная + Выборка.СуммаБезналичная;
					ДанныеПечати.СтавкаУслуги 				= Выборка.СтавкаНаличная;
					ДанныеПечати.СуммаНалогаУслуги 			= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог;
					
				ИначеЕсли Выборка.ВидДеятельности = Перечисления.ВидыДеятельностиЕН.УслугиСаун Тогда
					
					ДанныеПечати.СуммаСауна 				= Выборка.СуммаНаличная + Выборка.СуммаБезналичная;
					ДанныеПечати.СтавкаСауна 				= Выборка.СтавкаНаличная;
					ДанныеПечати.СуммаНалогаСауна 			= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог;
					
				ИначеЕсли Выборка.ВидДеятельности = Перечисления.ВидыДеятельностиЕН.УслугиБильярда Тогда
					
					ДанныеПечати.СуммаБильярд 				= Выборка.СуммаНаличная + Выборка.СуммаБезналичная;
					ДанныеПечати.СтавкаБильярд 				= Выборка.СтавкаНаличная;
					ДанныеПечати.СуммаНалогаБильярд 		= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог;
					
				ИначеЕсли Выборка.ВидДеятельности = Перечисления.ВидыДеятельностиЕН.УслугиБань Тогда
					
					ДанныеПечати.СуммаБаня 					= Выборка.СуммаНаличная + Выборка.СуммаБезналичная;
					ДанныеПечати.СтавкаБаня 				= Выборка.СтавкаНаличная;
					ДанныеПечати.СуммаНалогаБаня 			= Выборка.СуммаНаличнаяЕдиныйНалог + Выборка.СуммаБезналичнаяЕдиныйНалог;
					
				КонецЕсли;	
			КонецЦикла;	
			
			ДанныеПечати.Вставить("СуммаНалогаРаздел4", ДанныеПечати.СуммаНалогаИтогТорг + ДанныеПечати.СуммаНалогаИтогПрочее + ДанныеПечати.СуммаНалогаУслНДС
			+ ДанныеПечати.СуммаНалогаШвейное + ДанныеПечати.СуммаНалогаУслуги + ДанныеПечати.СуммаНалогаСауна + ДанныеПечати.СуммаНалогаБильярд + ДанныеПечати.СуммаНалогаБаня); 
			
			ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "устарела_ОтчетПоЕдиномуНалогу") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"устарела_ОтчетПоЕдиномуНалогу", 
		НСтр("ru = 'Отчет по единому налогу (устарел)'"), 
		устарела_ПечатьЕдиногоНалога(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоЕдиномуНалогу.устарела_ПФ_MXL_ОтчетПоЕдиномуНалогу");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетПоЕдиномуНалогу") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ОтчетПоЕдиномуНалогу", 
		НСтр("ru = 'Отчет по единому налогу'"), 
		ПечатьЕдиногоНалога(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоЕдиномуНалогу.ПФ_MXL_ОтчетПоЕдиномуНалогу");
	КонецЕсли;

КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "устарела_ОтчетПоЕдиномуНалогу";
	КомандаПечати.Представление = НСтр("ru = 'Отчет по единому налогу (устарел)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОтчетПоЕдиномуНалогу";
	КомандаПечати.Представление = НСтр("ru = 'Отчет по единому налогу'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 2;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция -ПолучитьКонтактнуюИнформацию
//
// Параметры:
//  Организация  - Спр.Ссылка - Спр.Организации 
// Возвращаемое значение:
//  Структура   - структура данных контактной информации
//
Функция ПолучитьКонтактнуюИнформацию(Организация)
	
	СведенияОбОрганизации = БухгалтерскийУчетСервер.ПолучитьСведенияОбОрганизации(Организация);

	Индекс = СведенияОбОрганизации.Индекс; 
	
	ГородНасПункт   = ?(СведенияОбОрганизации.Город  = "",СведенияОбОрганизации.НаселенныйПункт,СведенияОбОрганизации.Город);
	АдрОбластьГород = ?(СведенияОбОрганизации.Регион = "","",СведенияОбОрганизации.Регион + ",")
		+ ?(СведенияОбОрганизации.Район  = "","", " " + СведенияОбОрганизации.Район + ",") 
		+ ?(ГородНасПункт = "",""," " + ГородНасПункт); 
	АдресОрганизации = ?(СведенияОбОрганизации.Улица    = "","",СведенияОбОрганизации.Улица + ",")
		+ ?(СведенияОбОрганизации.Дом      = "",""," " + СведенияОбОрганизации.Дом + ",")
		+ ?(СведенияОбОрганизации.Корпус   = "",""," " + СведенияОбОрганизации.Корпус + ",")
		+ ?(СведенияОбОрганизации.Квартира = "",""," " + СведенияОбОрганизации.Квартира);
		
	Телефон = СведенияОбОрганизации.Тел;	
	Email = СведенияОбОрганизации.Email;
	
	Структура = Новый Структура();
	Структура.Вставить("Индекс", 			Индекс);	
	Структура.Вставить("АдрОбластьГород", 	АдрОбластьГород);
	Структура.Вставить("АдресОрганизации", 	АдресОрганизации);
	Структура.Вставить("Телефон", 			Телефон);
	Структура.Вставить("Email", 			Email);
	
	Возврат Структура;
	
КонецФункции // ПолучитьАдресОрганизации()

#КонецОбласти

#КонецЕсли
